
"""
Реалізуйте алгоритм сортування вибором.
"""
from numpy.testing.print_coercion_tables import print_coercion_table

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for i in range(0, n):
        for j in range(n-1, 0+i, -1):
            if array[i] > array[j]:
                array[i], array[j] = array[j], array[i]

    return array

